mvr.org
#+TITLE: Personal Configs
#+Author: Martin Varela
#+SEQ_TODO: PROPOSED TODO STARTED | DONE DEFERRED REJECTED
#+OPTIONS: H:2 num:nil toc:t
#+STARTUP: oddeven

* Personal information

  #+begin_src emacs-lisp
(setq user-full-name "Martin Varela")
(setq user-mail-address (
                         if (string= (system-name) "mvr-cnl") 
                            "martin.varela@vtt.fi" 
                          "mvr.rennes@gmail.com"))
(setq mvr-elisp-root "~/.emacs.d")

  #+end_src
  

* Local functions

** Screen Transparency and Color Themes

*** Color theme and chooser functions
    #+begin_src emacs-lisp
(add-to-list 'custom-theme-load-path (concat mvr-elisp-root "/src/tiago-theme/"))
(load-theme 'tiago t)
;;(load-theme 'zenburn t)
    #+end_src


*** Handling Transparency

    #+begin_src emacs-lisp
(defun make-frame-transparent ()
  (interactive)
  (set-frame-parameter nil 'alpha '(75 70)))

(defun make-frame-opaque ()
  (interactive)
  (set-frame-parameter nil 'alpha '(100 100)))


(set-frame-parameter (selected-frame) 'alpha '(100 100))
(add-to-list 'default-frame-alist '(alpha 100 100))
(eval-when-compile (require 'cl))
(defun toggle-transparency ()
  (interactive)
  (if (/=
	   (cadr (frame-parameter nil 'alpha))
	   100)
	  (make-frame-opaque)
	  (make-frame-transparent)))

    #+end_src

    

** Printing

*** Print to pdf

#+begin_src emacs-lisp
  
  (defun print-to-pdf ()
    "Prints the current buffer to a pdf file"
    (interactive)
    (ps-spool-buffer-with-faces)
    (switch-to-buffer "*PostScript*")
    (write-file "/tmp/tmp.ps")
    (kill-buffer "tmp.ps")
    (setq cmd (concat "ps2pdf14 /tmp/tmp.ps " (buffer-name) ".pdf"))
    (shell-command cmd)
    (shell-command "rm /tmp/tmp.ps")
    (message (concat "Saved to:  " (buffer-name) ".pdf")))
  
#+end_src emacs-lisp


*** Toggles for headers and color printing

#+begin_src emacs-lisp
  (defun disable-print-headers ()  (interactive) (setq ps-print-header nil))
  (defun enable-print-headers ()  (interactive) (setq ps-print-header 1))
  (defun disable-color-printing ()  (interactive) (setq ps-print-color-p nil))
  (defun enable-color-printing ()  (interactive) (setq ps-print-color-p 1)) 
#+end_src

** Frame maximization
#+begin_src emacs-lisp
  (defun get-frame-max-lines ()
    (- 
     (/ 
      (* (- (display-pixel-height) 20) (frame-height)) 
      (frame-pixel-height))
     2))
  
  (defun get-frame-max-cols ()
    (-
     (/
      (* (display-pixel-width) (frame-width))
      (frame-pixel-width)) 
     0  ))
  
  (defun maximize-frame () 
    (interactive)
    (set-frame-position (selected-frame) 0 20)
    (set-frame-size (selected-frame) (get-frame-max-cols) (get-frame-max-lines)))
  
  (defun half-frame-h ()
    (interactive)
    (set-frame-position (selected-frame) 0 20)
    (set-frame-size (selected-frame) (/ (get-frame-max-cols) 2) (get-frame-max-lines)))
  
  (defun half-frame-v ()
    (interactive)
    (set-frame-position (selected-frame) 0 20)
    (set-frame-size (selected-frame) (get-frame-max-cols) (/ (get-frame-max-lines)
                                                           2)))
  
  (defun halve-frame-h ()
    (interactive)
    (set-frame-position (selected-frame) 0 20)
    (set-frame-size (selected-frame) (/ (frame-width) 2) (frame-height)))
  
  (defun halve-frame-v ()
    (interactive)
    (set-frame-position (selected-frame) 0 20)
    (set-frame-size (selected-frame) (frame-width) (/ (frame-height)
                                                     2)))
  
;;  (maximize-frame)
#+end_src



** Window resizing

#+begin_src emacs-lisp
(defun shrink-window-two-thirds ()
  (interactive)
  (shrink-window-horizontally (truncate (* (get-frame-max-cols) 0.20))))
#+end_src




** Lorem Ipsum

#+begin_src emacs-lisp
(defun lorem ()
  (interactive)
  (insert "Lorem ipsum dolor sit amet, consectetuer adipiscing elit. Praesent libero orci, auctor sed, faucibus vestibulum, gravida vitae, arcu. Nunc posuere. Suspendisse potenti. Praesent in arcu ac nisl ultricies ultricies. Fusce eros. Sed pulvinar vehicula ante. Maecenas urna dolor, egestas vel, tristique et, porta eu, leo. Curabitur vitae sem eget arcu laoreet vulputate. Cras orci neque, faucibus et, rhoncus ac, venenatis ac, magna. Aenean eu lacus. Aliquam luctus facilisis augue. Nullam fringilla consectetuer sapien. Aenean neque augue, bibendum a, feugiat id, lobortis vel, nunc. Suspendisse in nibh quis erat condimentum pretium. Vestibulum tempor odio et leo. Sed sodales vestibulum justo. Cras convallis pellentesque augue. In eu magna. In pede turpis, feugiat pulvinar, sodales eget, bibendum consectetuer, magna. Pellentesque vitae augue."))
#+end_src



** Org-mode outline to FreeMind extraction

This function extracts the outline from an org-mode file, with no contents under
each header, and then converts that to a FreeMind mindmap.


#+begin_src emacs-lisp
(defun org-extract-mm ()
  "Extracts the outline of an org-mode file and exports it as a Freemind mindmap"
  (interactive)
  (save-excursion
    (let ((t-name (concat (buffer-name) "-freemind.mm"))
          (target (get-buffer-create (concat (buffer-name) "-freemind.org"))) 
          (title (re-search-forward "^#\+.*[tT]itle" (point-max) t)))
      (if (not (null title))
          (progn (goto-char title)
                 (append-to-buffer target (line-beginning-position)(+ 1 (line-end-position)))))
      (goto-char (point-min))
      (while (re-search-forward "^\*" nil t nil)
        (append-to-buffer (get-buffer target) (line-beginning-position)(+ 1 (line-end-position))))
      (switch-to-buffer target)
      (write-file t-name nil)
      (org-freemind-from-org-mode (buffer-name) (concat "out-"(format-time-string "%Y-%m-%d-%H.%M.%S") t-name)))))
#+end_src

** Org-mode LaTeX export headers for reports

#+begin_src emacs-lisp
(defun mvr-org-latex-report-header ()
"Inserts custom packages to be used in org-mode LaTeX exports of a certain type"
(interactive)
(insert-string "
#+LATEX_HEADER: \\usepackage{float}
#+LATEX_HEADER: \\usepackage{amsfonts,latexsym,setspace}
#+LATEX_HEADER: \\usepackage{natbib,fancyhdr}
#+LATEX_HEADER: \\usepackage{pdflscape}
#+LATEX_HEADER: \\usepackage{mvrreport}
#+LATEX_HEADER: \\setmainfont[Ligatures=TeX]{TeX Gyre Pagella}
#+LATEX_HEADER: \\runningheads{}{RUNNING TITLE GOES HERE}\n
#+LATEX_HEADER: \\hypersetup{bookmarks=true, unicode=true, pdfstartview={FitH}, pdftitle={TITLE GOES HERE}, pdfauthor={Martín Varela}, pdfsubject={SUBJECT GOES HERE}, pdfkeywords={KW1} {KW2},pdfnewwindow=true, colorlinks=true}\n"))

#+end_src

#+begin_src emacs-lisp
(defun mvr-org-latex-beamer-header ()
"Inserts custom packages to be used in org-mode LaTeX exports of a certain type"
(interactive)
(insert-string "
#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [bigger,xetex]
#+BEAMER_FRAME_LEVEL: 2
#+LATEX_HEADER: \\setsansfont[Ligatures=TeX]{Linux Biolinum O}
#+LATEX_HEADER: \\usepackage{vttbeamer}
#+BEAMER_HEADER_EXTRA: \\author[M. Varela]{Mart\\'{\\i}n Varela}
#+LATEX_HEADER: \\hypersetup{bookmarks=true, unicode=true, pdfstartview={FitH}, pdftitle={TITLE GOES HERE}, pdfauthor={Martín Varela}, pdfsubject={SUBJECT GOES HERE}, pdfkeywords={KW1} {KW2},pdfnewwindow=true, colorlinks=false}#+LATEX_HEADER: \\institute[VTT]{VTT Technical Research Centre of Finland}"))
#+end_src

** Make LaTeX tabular environments fit the page

#+begin_src emacs-lisp
(defun mvr-latex-table-fit-to-page ()
  "Wrap the next tabular environment in a resizebox command, so that it does not spill out of the page"
  (interactive)
  (progn
    (re-search-forward "^[\t ]*[\\]begin[\t ]*{[\t ]*tabular" (point-max) t)
    (move-beginning-of-line nil)
    (insert "\\resizebox{\\textwidth}{!}{\n")
    (re-search-forward "[\\]end[\t ]*{[\t ]*tabular[\t ]*}" (point-max) t)
    (insert "}")
    ))

#+end_src

* Personalized options for different modes and packages


** Highlighting changes

   #+begin_src emacs-lisp
  ;   (global-highlight-changes-mode t)
  ;   (setq highlight-changes-visibility-initial-state nil)
   #+end_src


** Frame titles
   #+begin_src emacs-lisp
     (setq frame-title-format
       '("emacs%@" (:eval (system-name)) ": " (:eval (if (buffer-file-name)
                     (abbreviate-file-name (buffer-file-name))
                       "%b")) " [%*]"))
     
   #+end_src

   
** Hooks for using text mode enhancements 

   #+begin_src emacs-lisp
 (add-hook 'latex-mode-hook 'turn-on-auto-fill)
 (add-hook 'org-mode-hook 'turn-on-auto-fill)
         ;; (add-hook 'latex-mode-hook 'flyspell-mode)
         ;; (add-hook 'org-mode-hook 'flyspell-mode)
   #+end_src
   
Handling ".eml" files in message-mode

#+begin_src emacs-lisp
 (add-to-list 'auto-mode-alist '("\\.eml$" . message-mode))
#+end_src

** Haskell mode options

   #+begin_src emacs-lisp 
          (starter-kit-load "starter-kit-haskell.org")
          
          (load "haskell-site-file")
          (add-hook 'haskell-mode-hook 'turn-on-haskell-doc-mode)
          (add-hook 'haskell-mode-hook 'turn-on-haskell-indentation)
          (add-to-list 'auto-mode-alist '("\\.hs$" . haskell-mode))
          (add-hook 'haskell-mode-hook 'turn-off-auto-fill)
          (setq haskell-literate-default 'tex)
          (require 'ghc)
          (autoload 'ghc-init "ghc" nil t)
          ;;(add-hook 'haskell-mode-hook (lambda () (ghc-init)))
          (add-hook 'haskell-mode-hook (lambda () (ghc-init) (flymake-mode)))
     ;     (add-to-list 'haskell-mode-hook '(auto-fill-mode -1))
   #+end_src emacs-lisp


** Org-mode options

