mvr.org
*** Setup the org-agenda files to be considered

    #+begin_src emacs-lisp
      (setq diary-file (concat mvr-elisp-root "/diary/diary"))
      (setq org-agenda-include-diary t)
      (setq org-agenda-files (file-expand-wildcards (concat mvr-elisp-root "/org-agenda-files/*.org")))
    #+end_src emacs-lisp



*** Org-agenda and iCal integration

#+begin_src emacs-lisp
(require 'org-mac-iCal)
(setq org-agenda-custom-commands
      '(("I" "Import diary from iCal" agenda ""
         ((org-agenda-mode-hook
           (lambda ()
             (org-mac-iCal)))))))

(add-hook 'org-agenda-cleanup-fancy-diary-hook
          (lambda ()
            (goto-char (point-min))
            (save-excursion
              (while (re-search-forward "^[a-z]" nil t)
                (goto-char (match-beginning 0))
                (insert "0:00-24:00 ")))
            (while (re-search-forward "^ [a-z]" nil t)
              (goto-char (match-beginning 0))
              (save-excursion
                (re-search-backward "^[0-9]+:[0-9]+-[0-9]+:[0-9]+ " nil t))
              (insert (match-string 0)))))
#+end_src
*** Org-agenda and appt integration

This was taken from [[http://emacs-fu.blogspot.com/2009/11/showing-pop-ups.html][this blog post]], with the display function replaced by my own.

 #+begin_src emacs-lisp

(setq
  appt-message-warning-time 20 ;; warn 15 min in advance

  appt-display-mode-line t     ;; show in the modeline
  appt-display-format 'window) ;; use our func
(appt-activate 1)              ;; active appt (appointment notification)
(display-time)                 ;; time display is required for this...

 ;; update appt each time agenda opened

(add-hook 'org-finalize-agenda-hook 'org-agenda-to-appt)


(defun mvr-display-appt (minutes current-time msg)
  "Display appt messages"
  (let ((gmsg 
         (if (null (listp msg))
             (format "In %s minutes: \n\t%s" minutes msg )
             (format "In %s minutes: \n\t%s" 
                     (if (listp minutes) 
                         (car minutes)
                       (minutes)) 
                     (concat 
                      (mapconcat '(lambda (x) (identity x)) msg "\n\t" ) "\n")))))
    (growl "Reminder" gmsg)))

(setq appt-disp-window-function (function mvr-display-appt))

#+end_src 

*** Ditaa jar location

    #+begin_src emacs-lisp
      (setq org-ditaa-jar-path
                (concat mvr-elisp-root "/src/org/contrib/scripts/ditaa.jar"))
     #+end_src emacs-lisp


*** Org-babel Gnuplot support

    #+begin_src emacs-lisp 
             (org-babel-do-load-languages
              'org-babel-load-languages
               (cons '(gnuplot . t)
                  org-babel-load-languages))
    #+end_src emacs-lisp


*** Org-babel org support

    #+begin_src emacs-lisp 
      (org-babel-do-load-languages
      'org-babel-load-languages
      (cons '(org . t)
            org-babel-load-languages))
    #+end_src emacs-lisp


*** Pretty indentation

    #+begin_src emacs-lisp
      (setq org-startup-indented t) 
    #+end_src emacs-lisp


*** No validator link in HTML exports

#+BEGIN_SRC emacs-lisp
  (setq org-export-html-validation-link nil)
#+END_SRC



*** Modern-day packages for export to LaTeX (for use with XeLaTeX)

#+begin_src emacs-lisp
(setq org-export-latex-default-packages-alist  '(("" "fixltx2e" nil)
                                                 ("" "graphicx" t)
                                                 ("" "longtable" nil)
                                                 ("" "float" nil)
                                                 ("" "wrapfig" nil)
                                                 ("" "soul" t)
                                                 ("" "textcomp" t)
                                                 ("" "marvosym" t)
                                                 ("" "wasysym" t)
                                                 ("" "latexsym" t)
                                                 ("" "amssymb" t)
                                                 ("" "fontspec" t)
                                                 ("" "natbib" t)
                                                 ("" "fancyhdr" t)
                                                 "\\tolerance=1000"))
#+end_src

*** Agenda support for google weather
#+begin_src emacs-lisp
  (require 'org-google-weather)
  (setq org-google-weather-icon-directory (concat mvr-elisp-root "/src/google-weather-el/icons/"))
#+end_src

** Ido-mode

*** Interactive do, find-file and iswitchb replacement with fuzzy/flex matching.

#+begin_src emacs-lisp
(ido-mode t)
(ido-everywhere 1)
(setq ido-enable-flex-matching t) ; fuzzy matching is a must have
(setq ido-enable-last-directory-history t) 
(setq ido-show-dot-for-dired t)
(setq ido-use-filename-at-point nil)
#+end_src


*** Command completion in the minibuffer

#+begin_src emacs-lisp
 (smex-initialize)
 (setq smex-save-file (concat mvr-elisp-root "/smex-persist/smex.history"))
#+end_src


*** New buffers

#+begin_src emacs-lisp
(setq ido-create-new-buffer 'always)
#+end_src

*** File extension priorities

#+begin_src emacs-lisp
(setq ido-file-extensions-order '(".org" ".tex" ".txt" ".hs" ".lhs" ".el" ".rb"
".cfg" ".c" ".h" ".html"))
#+end_src




** ERC
#+begin_src emacs-lisp
  (load "~/.ercpass.el")
     
  (require 'erc-services)
  (erc-services-mode 1)
  (setq erc-prompt-for-nickserv-password nil)     
  (setq erc-nickserv-passwords
         `((freenode     (("mvarela" . ,mvr-freenode-pass)))))

      
  (require 'erc-join)
  (erc-autojoin-mode 1)
  (setq erc-autojoin-channels-alist
            '(("freenode.net" "#emacs" "#haskell")))
      
      
  (require 'erc-match)
  (setq erc-keywords '("mvarela"))
  (erc-match-mode)
      
  (require 'erc-track)
  (erc-track-mode t) ; was (erc-track-modified-channels-mode t)
                         ; Note: erc-track-modified-channels-mode changed
                         ; to erc-track-mode as of erc-track.el
                         ; CVS revision 1.23 (November 2002)
      
  (add-hook 'erc-mode-hook
            '(lambda ()
                (require 'erc-pcomplete)
                (pcomplete-erc-setup)
                (erc-completion-mode 1)))
      
  (require 'erc-fill)
  (erc-fill-mode t)
      
  (require 'erc-ring)
  (erc-ring-mode t)
      
  (require 'erc-netsplit)
  (erc-netsplit-mode t)
      
  (erc-timestamp-mode t)
  (setq erc-timestamp-format "[%R-%m/%d]")
      
  (erc-button-mode t) ;slow
  (erc-readonly-mode nil)
  (setq erc-user-full-name "Martin Varela")
  (setq erc-email-userid "mvr.rennes@gmail.com")
      
      
  (setq erc-log-insert-log-on-open nil)
  (setq erc-log-channels nil)
  (setq erc-log-channels-directory "~/.irclogs/")
  (setq erc-save-buffer-on-part nil)
  (setq erc-hide-timestamps nil)
      
      
  (defadvice save-buffers-kill-emacs (before save-logs (arg) activate)
    (save-some-buffers t (lambda () (when (and (eq major-mode 'erc-mode)
                                               (not (null buffer-file-name)))))))
      
  (add-hook 'erc-insert-post-hook 'erc-save-buffer-in-logs)
  (add-hook 'erc-mode-hook '(lambda () (when (not (featurep 'xemacs))
                                         (set (make-variable-buffer-local
                                               'coding-system-for-write)
                                               'emacs-mule))))
  ;; end logging
      
  ;; Truncate buffers so they don't hog core.
  (setq erc-max-buffer-size 20000)
  (defvar erc-insert-post-hook)
  (add-hook 'erc-insert-post-hook 'erc-truncate-buffer)
  (setq erc-truncate-buffer-on-save t)
      
      
  ;; Clears out annoying erc-track-mode stuff for when we don't care.
  ;; Useful for when ChanServ restarts :P
  (defun reset-erc-track-mode ()
    (interactive)
    (setq erc-modified-channels-alist nil)
    (erc-modified-channels-update))
  (global-set-key (kbd "C-c r") 'reset-erc-track-mode)
      
      
  ;;; Finally, connect to the networks.
  (defun irc-maybe ()
    "Connect to IRC."
    (interactive)
    (when (y-or-n-p "IRC? ")
      (erc :server "irc.freenode.net" :port 6667
                  :nick "mvarela" :full-name "Martin Varela")))
      
#+end_src


** Gnuplot

#+begin_src emacs-lisp
     (add-to-list 'auto-mode-alist '("\\.gnup$" . gnuplot-mode))
#+end_src


** Spelling

#+begin_src emacs-lisp
(eval-after-load "ispell"
   (progn
     (setq ispell-dictionary "en_US"
           ispell-extra-args '("-a" "-c" )
           ispell-silently-savep t
 )))
  (setq-default ispell-program-name "aspell")
#+end_src


