mvr.org
** LaTeX stuff

Quick helper functions for using 'changes' mode

#+begin_src emacs-lisp
(setq mvr-changes-id "mvr")
(defun mvr-changes-add ()
"Inserts an \added command to a LaTeX document using the 'changes' package"
  (interactive)
    (insert (concat "\\added[id=" mvr-changes-id  "]{}"))
    (goto-char (- (point) 1))
        (if (evil-mode)(evil-insert 0)))

(defun mvr-changes-delete ()
  "Inserts an \delete command to a LaTeX document using the 'changes' package"
  (interactive)
  (if (use-region-p)
      (save-excursion
        (let ((low (region-beginning))
              (high (region-end))
               (command (concat "\\deleted[id=" mvr-changes-id  "]{")))
        (goto-char high)
        (insert "}")
        (goto-char low)
        (insert command)))
    (message "This command can only act on an active region")))



(defun mvr-changes-replace ()
  "Inserts an \replace command to a LaTeX document using the 'changes' package"
  (interactive)
  (if (use-region-p)
      (let ((low (region-beginning))
            (high (region-end))
            (command (concat "\\replaced[id=" mvr-changes-id  "]{}{")))
        (goto-char high)
        (insert "}")
        (goto-char low)
        (insert command)
        (goto-char (- (point) 2))
        (if (evil-mode)(evil-insert 0)))
    (message "This command can only act on an active region")))
#+end_src


RefTeX enabled in AucTeX

#+begin_src emacs-lisp
  (setq reftex-plug-into-AUCTeX t)
  (add-hook 'LaTeX-mode-hook 'turn-on-reftex)
#+end_src

This below taken from: http://www.cs.berkeley.edu/~prmohan/emacs/latex.html and
modified slightly.
#+begin_src emacs-lisp
  

(add-hook 'LaTeX-mode-hook 'TeX-source-correlate-mode)
(setq TeX-source-correlate-method 'synctex)
(add-hook 'LaTeX-mode-hook (lambda ()
(add-to-list 'TeX-expand-list
	       '("%q" skim-make-url))))
(defun skim-make-url () (concat
		(TeX-current-line)
		" "
		(expand-file-name (funcall file (TeX-output-extension) t)
			(file-name-directory (TeX-master-file)))
		" "
		(buffer-file-name)))
(setq TeX-view-program-list '(("Okular" "okular --unique %u") ("Skim" "/Applications/Skim.app/Contents/SharedSupport/displayline %q")))
(if (eq system-type 'darwin)
    (setq TeX-view-program-selection '((output-pdf "Skim"))))
    
 #+end_src


Old stuff below:

    ;; (custom-set-variables '(TeX-command-list 
    ;;    (quote (
    ;;            ("XeLaTeX_SyncteX" "%`xelatex --interaction=nonstopmode --synctex=1%(mode)%' %t" TeX-run-TeX
    ;;    nil (latex-mode doctex-mode) :help "Run XeLaTeX") 
    ;;            ("XeLaTeX_NonStop" "%`xelatex --interaction=nonstopmode%' %t" TeX-run-TeX nil (latex-mode doctex-mode) :help "Run XeLaTeX") 
    ;;            ("TeX" "%(PDF)%(tex) %`%S%(PDFout)%(mode)%' %t" TeX-run-TeX nil (plain-tex-mode texinfo-mode ams-tex-mode) :help "Run plain TeX") 
    ;;            ("LaTeX" "%`%l%(mode)%' %t" TeX-run-TeX nil (latex-mode doctex-mode) :help "Run LaTeX") 
    ;;            ("Makeinfo" "makeinfo %t" TeX-run-compile nil (texinfo-mode) :help "Run Makeinfo with Info output") 
    ;;            ("Makeinfo HTML" "makeinfo --html %t" TeX-run-compile nil (texinfo-mode) :help "Run Makeinfo with HTML output") 
    ;;            ("AmSTeX" "%(PDF)amstex %`%S%(PDFout)%(mode)%' %t" TeX-run-TeX nil (ams-tex-mode) :help "Run AMSTeX") 
    ;;            ("ConTeXt" "texexec --once --texutil %(execopts)%t" TeX-run-TeX nil (context-mode) :help "Run ConTeXt once") 
    ;;            ("ConTeXt Full" "texexec %(execopts)%t" TeX-run-TeX nil (context-mode) :help "Run ConTeXt until completion") 
    ;;            ("BibTeX" "bibtex %s" TeX-run-BibTeX nil t :help "Run BibTeX") 
    ;;            ("View" "%V" TeX-run-discard-or-function nil t :help "Run Viewer") 
    ;;            ("Print" "%p" TeX-run-command t t :help "Print the file") 
    ;;            ("Queue" "%q" TeX-run-background nil t :help "View the printer queue" :visible TeX-queue-command) 
    ;;            ("File" "%(o?)dvips %d -o %f " TeX-run-command t t :help "Generate PostScript file") 
    ;;            ("Index" "makeindex %s" TeX-run-command nil t :help "Create index file") 
    ;;            ("Check" "lacheck %s" TeX-run-compile nil (latex-mode) :help "Check LaTeX file for correctness") 
    ;;            ("Spell" "(TeX-ispell-document \"\")" TeX-run-function nil t :help "Spell-check the document") 
    ;;            ("Clean" "TeX-clean" TeX-run-function nil t :help "Delete generated intermediate files") 
    ;;            ("Clean All" "(TeX-clean t)" TeX-run-function nil t :help "Delete generated intermediate and output files") 
    ;;            ("Other" "" TeX-run-command t t :help "Run an arbitrary command") 
    ;;            ("Jump to PDF" "%V" TeX-run-discard-or-function nil t :help "Run Viewer")))))
    
    
    ;; (custom-set-variables
    ;;  '(LaTeX-command "xelatex  --interaction=nonstopmode --synctex=1")
    ;;  '(TeX-view-program-list (quote (("Skim" "/Applications/Skim.app/Contents/SharedSupport/displayline %n %o %b") ("Preview" "open -a Preview.app %o"))))
    ;; )
    ;; (add-hook 'LaTeX-mode-hook 'TeX-source-correlate-mode)
    ;; (setq TeX-source-correlate-method 'synctex)


For RefTex TOC generation, use a horizontal window split

#+begin_src emacs-lisp
(setq reftex-toc-split-windows-horizontally t)

#+end_src

** Orgtble-mode hooks

#+begin_src emacs-lisp
(add-hook 'text-mode-hook 'orgtbl-mode)
#+end_src


** Writing style helpers

#+begin_src emacs-lisp
(require 'textlint)
(require 'artbollocks-mode)
#+end_src


** Which-func-mode

#+begin_src emacs-lisp
(add-hook 'prog-mode-hook 'which-func-mode)
#+end_src




** Gnus and Gmail

#+begin_src emacs-lisp
(setq gnus-select-method '(nnimap "gmail"
				  (nnimap-address "imap.gmail.com")
				  (nnimap-server-port 993)
				  (nnimap-stream ssl)))

(setq message-send-mail-function 'smtpmail-send-it
      smtpmail-starttls-credentials '(("smtp.gmail.com" 587 nil nil))
      smtpmail-auth-credentials '(("smtp.gmail.com" 587 "mvr.rennes@gmail.com" nil))
      smtpmail-default-smtp-server "smtp.gmail.com"
      smtpmail-smtp-server "smtp.gmail.com"
      smtpmail-smtp-service 587)

(setq gnus-thread-sort-functions
      '((not gnus-thread-sort-by-date) gnus-thread-sort-by-author))

(setq gnus-article-sort-functions
      '((not gnus-article-sort-by-date) gnus-article-sort-by-author))
#+end_src



** Eshell

Set the prompt closer to the one I use in Bash

#+begin_src emacs-lisp
  (setq eshell-prompt-function
    (lambda ()
      (concat 
       (format-time-string "<%H:%M:%S> [" (current-time))
       (eshell/whoami)
       "@"
       (system-name)
       "]: "
       (eshell/pwd)
       "\n"
        (if (= (user-uid) 0) "# " "$ "))))
#+end_src


** gForth mode

Just set the autoload options.

#+begin_src emacs-lisp
  (autoload 'forth-mode "gforth.el")
  (autoload 'forth-block-mode "gforth.el")
  (add-to-list 'auto-mode-alist '("\\.fs$" . forth-mode))
#+end_src



** Breadcrumb

#+begin_src emacs-lisp
; commented, as using evil-mode this can easily be done with marks
;(require 'breadcrumb)
#+end_src


** Ace-jump

#+begin_src emacs-lisp
  (require 'ace-jump-mode)
#+end_src

** Expand-Region
#+begin_src emacs-lisp
(require 'expand-region)
#+end_src

** Mark-multiple
#+begin_src emacs-lisp
(require 'mark-more-like-this)
(global-set-key (kbd "C-M-m") 'mark-more-like-this)
#+end_src 
