mvr.el

(setq reftex-plug-into-AUCTeX t)
(add-hook 'LaTeX-mode-hook 'turn-on-reftex)

(custom-set-variables '(TeX-command-list 
   (quote (
           ("XeLaTeX_SyncteX" "%`xelatex --synctex=1%(mode)%' %t" TeX-run-TeX
   nil (latex-mode doctex-mode) :help "Run XeLaTeX") 
           ("XeLaTeX_NonStop" "%`xelatex --interaction=nonstopmode%' %t" TeX-run-TeX nil (latex-mode doctex-mode) :help "Run XeLaTeX") 
           ("TeX" "%(PDF)%(tex) %`%S%(PDFout)%(mode)%' %t" TeX-run-TeX nil (plain-tex-mode texinfo-mode ams-tex-mode) :help "Run plain TeX") 
           ("LaTeX" "%`%l%(mode)%' %t" TeX-run-TeX nil (latex-mode doctex-mode) :help "Run LaTeX") 
           ("Makeinfo" "makeinfo %t" TeX-run-compile nil (texinfo-mode) :help "Run Makeinfo with Info output") 
           ("Makeinfo HTML" "makeinfo --html %t" TeX-run-compile nil (texinfo-mode) :help "Run Makeinfo with HTML output") 
           ("AmSTeX" "%(PDF)amstex %`%S%(PDFout)%(mode)%' %t" TeX-run-TeX nil (ams-tex-mode) :help "Run AMSTeX") 
           ("ConTeXt" "texexec --once --texutil %(execopts)%t" TeX-run-TeX nil (context-mode) :help "Run ConTeXt once") 
           ("ConTeXt Full" "texexec %(execopts)%t" TeX-run-TeX nil (context-mode) :help "Run ConTeXt until completion") 
           ("BibTeX" "bibtex %s" TeX-run-BibTeX nil t :help "Run BibTeX") 
           ("View" "%V" TeX-run-discard-or-function nil t :help "Run Viewer") 
           ("Print" "%p" TeX-run-command t t :help "Print the file") 
           ("Queue" "%q" TeX-run-background nil t :help "View the printer queue" :visible TeX-queue-command) 
           ("File" "%(o?)dvips %d -o %f " TeX-run-command t t :help "Generate PostScript file") 
           ("Index" "makeindex %s" TeX-run-command nil t :help "Create index file") 
           ("Check" "lacheck %s" TeX-run-compile nil (latex-mode) :help "Check LaTeX file for correctness") 
           ("Spell" "(TeX-ispell-document \"\")" TeX-run-function nil t :help "Spell-check the document") 
           ("Clean" "TeX-clean" TeX-run-function nil t :help "Delete generated intermediate files") 
           ("Clean All" "(TeX-clean t)" TeX-run-function nil t :help "Delete generated intermediate and output files") 
           ("Other" "" TeX-run-command t t :help "Run an arbitrary command") 
           ("Jump to PDF" "%V" TeX-run-discard-or-function nil t :help "Run Viewer")))))


(custom-set-variables
 '(LaTeX-command "latex -synctex=1")
 '(TeX-view-program-list (quote (("Skim" "/Applications/Skim.app/Contents/SharedSupport/displayline %n %o %b") ("Preview" "open -a Preview.app %o"))))
)
(setq TeX-source-correlate-method 'synctex)
(add-hook 'LaTeX-mode-hook 'TeX-source-correlate-mode)

(setq reftex-toc-split-windows-horizontally t)

(add-hook 'text-mode-hook 'orgtbl-mode)

(require 'textlint)
(require 'artbollocks-mode)

(add-hook 'prog-mode-hook 'which-func-mode)

(setq gnus-select-method '(nnimap "gmail"
                                  (nnimap-address "imap.gmail.com")
                                  (nnimap-server-port 993)
                                  (nnimap-stream ssl)))

(setq message-send-mail-function 'smtpmail-send-it
      smtpmail-starttls-credentials '(("smtp.gmail.com" 587 nil nil))
      smtpmail-auth-credentials '(("smtp.gmail.com" 587 "mvr.rennes@gmail.com" nil))
      smtpmail-default-smtp-server "smtp.gmail.com"
      smtpmail-smtp-server "smtp.gmail.com"
      smtpmail-smtp-service 587)

(setq gnus-thread-sort-functions
      '((not gnus-thread-sort-by-date) gnus-thread-sort-by-author))

(setq gnus-article-sort-functions
      '((not gnus-article-sort-by-date) gnus-article-sort-by-author))

(setq eshell-prompt-function
  (lambda ()
    (concat 
     (format-time-string "<%H:%M:%S> [" (current-time))
     (eshell/whoami)
     "]: "
     (eshell/pwd)
     "\n"
      (if (= (user-uid) 0) "# " "$ "))))
