mvr.org
** Evil
Lifted most of this from [[https://github.com/cofi/dotfiles/blob/master/emacs.d/cofi-evil.el][cofi's config]]

Some auxiliary functions...

#+begin_src emacs-lisp
(require 'cl)
(require 'surround)
(global-surround-mode 1)
(defun fill-keymap (keymap &rest mappings)
  "Fill `KEYMAP' with `MAPPINGS'.
See `pour-mappings-to'."
  (pour-mappings-to keymap mappings))

(defun pour-mappings-to (map mappings)
  "Calls `cofi/set-key' with `map' on every key-fun pair in `MAPPINGS'.
`MAPPINGS' is a list of string-fun pairs, with a `READ-KBD-MACRO'-readable string and a interactive-fun."
  (dolist (mapping (group mappings 2))
    (cofi/set-key map (car mapping) (cadr mapping)))
  map)

(defun cofi/set-key (map spec cmd)
  "Set in `map' `spec' to `cmd'.

`Map' may be `'global' `'local' or a keymap.
A `spec' can be a `read-kbd-macro'-readable string or a vector."
  (let ((setter-fun (case map
                      (global #'global-set-key)
                      (local  #'local-set-key)
                      (t      (lambda (key def) (define-key map key def)))))
        (key (typecase spec
               (vector spec)
               (string (read-kbd-macro spec))
               (t (error "wrong argument")))))
    (funcall setter-fun key cmd)))

(defun group (lst n)
  "Group `LST' into portions of `N'."
  (let (groups)
    (while lst
      (push (take n lst) groups)
      (setq lst (nthcdr n lst)))
    (nreverse groups)))

(defun take (n lst)
  "Return atmost the first `N' items of `LST'."
  (let (acc '())
    (while (and lst (> n 0))
      (decf n)
      (push (car lst) acc)
      (setq  lst (cdr lst)))
    (nreverse acc)))
#+end_src


Relative / absolute numbering

#+begin_src emacs-lisp
(defun mvr-evil-rnu () (interactive) (setq linum-format 'my-linum-relative-line-numbers))
(defun mvr-evil-nu () (interactive) (setq linum-format "%4d "))
;;(add-hook 'evil-insert-state-entry-hook 'mvr-evil-nu)
;;(add-hook 'evil-normal-state-entry-hook 'mvr-evil-rnu)
#+end_src


Break a line (inverse of 'J')

#+begin_src emacs-lisp
(defun mvr-evil-break-line()
  "splits a line"
  (interactive)
  (save-excursion (insert "\n")))
#+end_src

#+begin_src emacs-lisp
     (require 'evil-numbers)
     (setq evil-leader/leader ",")
     (require 'evil-leader)
     (require 'evil)
     (evil-mode 1)
     (fill-keymap evil-normal-state-map
                  "+"     'evil-numbers/inc-at-pt
                  "-"     'evil-numbers/dec-at-pt
                  "SPC"   'ace-jump-char-mode
                  "S-SPC" 'ace-jump-word-mode
                  "C-SPC" 'ace-jump-line-mode
                  "go"    'goto-char
                  "C-t"   'transpose-chars
                  "M-t"   'transpose-words 
                  "C-:"   'eval-expression
                  "M-a"   'mvr-changes-add) 

     (fill-keymap evil-motion-state-map
                  "_"     'evil-first-non-blank
                  "C-e"   'end-of-line
                  "C-S-d" 'evil-scroll-up
                  "C-S-f" 'evil-scroll-page-up
                  "_"     'evil-first-non-blank
                  "C-y"   nil)
     
  (fill-keymap evil-visual-state-map
                  "/"     'comment-or-uncomment-region
                  "\\"     'indent-region
                  "SPC"   'ace-jump-char-mode
                  "S-SPC" 'ace-jump-word-mode
                  "C-SPC" 'ace-jump-line-mode
                  "A"     'mark-all-like-this 
                  "N"     'mark-previous-like-this 
                  "n"     'mark-more-like-this
                  "M-c"   'mvr-changes-replace
                  "M-d"   'mvr-changes-delete)
     (fill-keymap evil-insert-state-map
                  "C-e" 'end-of-line
                   "M-'" 'ucs-insert)
   (evil-declare-key 'normal org-mode-map
     (kbd "RET") 'org-open-at-point
     "za"        'org-cycle
     "zA"        'org-shifttab
     "zm"        'hide-body
     "zr"        'show-all
     "zo"        'show-subtree
     "zO"        'show-all
     "zc"        'hide-subtree
     "zC"        'hide-all
     (kbd "M-j") 'org-shiftleft
     (kbd "M-k") 'org-shiftright
     (kbd "M-H") 'org-metaleft
     (kbd "M-J") 'org-metadown
     (kbd "M-K") 'org-metaup
     (kbd "M-L") 'org-metaright)
   
   (evil-declare-key 'insert org-mode-map
     (kbd "M-j") 'org-shiftleft
     (kbd "M-k") 'org-shiftright
     (kbd "M-H") 'org-metaleft
     (kbd "M-J") 'org-metadown
     (kbd "M-K") 'org-metaup
     (kbd "M-L") 'org-metaright)  
     
   (evil-leader/set-key
     "b" 'ido-switch-buffer
     "B" 'ibuffer
     "k" 'kill-buffer 
     "m" 'compile
     "s" 'save-buffer
     "f" 'ido-find-file
     "SPC" 'ace-jump-word-mode
     "q" 'fill-paragraph
     "x" 'smex
     "r" 'mvr-evil-rnu
     "R" 'mvr-evil-nu
     "l" 'linum-mode
     "d" 'edit-server-done
     "3" 'split-window-horizontally
     "2" 'split-window-vertically
     "1" 'delete-other-windows
     "0" 'delete-window
     "o" 'other-window
     "z" 'suspend-emacs
     "J" 'mvr-evil-break-line
     "g" 'magit-status)
#+end_src

** Linum

#+begin_src emacs-lisp

(defvar my-linum-format-string "%4d ")
(setq linum-format "%4d ")
(add-hook 'linum-before-numbering-hook 'my-linum-get-format-string)
(defun my-linum-get-format-string ()
  (let* ((width (max 4 (length (number-to-string
                             (count-lines (point-min) (point-max))))))
         (format (concat "%" (number-to-string width) "d ")))
    (setq my-linum-format-string format)))

(defvar my-linum-current-line-number 0)

(defun my-linum-relative-line-numbers (line-number)
  (let ((offset (abs (- line-number my-linum-current-line-number))))
    (propertize (format my-linum-format-string offset) 'face 'linum)))

(defadvice linum-update (around my-linum-update)
  (let ((my-linum-current-line-number (line-number-at-pos)))
    ad-do-it))
(ad-activate 'linum-update)

#+end_src 
** Projectile

#+begin_src emacs-lisp
(require 'projectile)
(projectile-global-mode)
#+end_src
** Rinari and RHTML

#+begin_src emacs-lisp
 (require 'rinari)
;;; rhtml-mode
     (require 'rhtml-mode)
     (add-hook 'rhtml-mode-hook
     	  (lambda () (rinari-launch)))
#+end_src 
* Misc. Settings

** Line-wrapping

   #+begin_src emacs-lisp
     (set-default 'fill-column 80)
   #+end_src

** Don't truncate lines

   #+begin_src emacs-lisp
     (setq truncate-lines t)
     (setq truncate-partial-width-windows nil)
   #+end_src

** Column numbers

   #+begin_src emacs-lisp 
     (setq column-number-mode t)
   #+end_src emacs-lisp

** History

#+begin_src emacs-lisp
  (setq savehist-file (concat mvr-elisp-root "/history"))
#+end_src

** No Scroll bars

#+begin_src emacs-lisp
  (when (fboundp 'toggle-scroll-bar)
    (toggle-scroll-bar -1))
#+end_src

** Auto revert mode

Reload files that were modified on disk.

#+begin_src emacs-lisp
  (global-auto-revert-mode t)
#+end_src

** Soft word wrap (visual line mode)
#+begin_src emacs-lisp
  (visual-line-mode t)
  (add-hook 'text-mode-hook 'visual-line-mode)
#+end_src


** Optional starter kit modules

#+begin_src emacs-lisp
(starter-kit-load "ruby")
;;(starter-kit-load "lisp")
;;(starter-kit-load "misc-recommended")
(starter-kit-load "org")
#+end_src

** Window systems -- remove visual cruft                             :visual:
   :PROPERTIES:
   :CUSTOM_ID: window-system
   :END:
#+srcname: starter-kit-window-view-stuff-recommended
#+begin_src emacs-lisp 
(when window-system
  (tooltip-mode -1)
  (tool-bar-mode -1))
#+end_src

** No Menu Bar                                                       :visual:
You really don't need this; trust me.
#+srcname: starter-kit-no-menu
#+begin_src emacs-lisp 
(menu-bar-mode -1)
#+end_src

** Automatically make scripts executable on save

#+begin_src emacs-lisp
(add-hook 'after-save-hook
  'executable-make-buffer-file-executable-if-script-p)
#+end_src


** Disable confirmations for new files / buffers

#+begin_src emacs-lisp
  (setq confirm-nonexistent-file-or-buffer nil)
#+end_src


** Growl

#+begin_src emacs-lisp
  (require 'growl)
#+end_src

** Fringe
 #+begin_src emacs-lisp
   (fringe-mode 0)
#+end_src
* OS X-specific settings


** OS X workaround for missing PATH data

   #+begin_src emacs-lisp
          ;;(if (eq system-type 'darwin) (funcall (lambda ()(setenv "PATH" (concat "/opt/local/bin:/usr/local/bin:" (getenv "PATH"))) (push "/opt/local/bin" exec-path))))
          (if (eq system-type 'darwin) (progn (setenv "PATH" (concat
          "/opt/local/bin:/usr/local/bin:/usr/texbin/:" (getenv "PATH"))) (append
          (list "/opt/local/bin" "/usr/local/bin" "/usr/texbin/" "/Users/mvr/bin")
          exec-path)
          (setq exec-path (append
          (list "/opt/local/bin" "/usr/local/bin" "/usr/texbin/" "/Users/mvr/bin")
          exec-path))))
   #+end_src


** OS X Raise Emacs Frame

   #+begin_src emacs-lisp
     (defun ns-raise-emacs ()
       (ns-do-applescript "tell application \"Emacs\" to activate"))
   #+end_src



** OS X Use CMD as META

   #+begin_src emacs-lisp
     (setq ns-command-modifier (quote meta))
   #+end_src

** OS X Browser

#+begin_src emacs-lisp
 (setq browse-url-browser-function 'browse-default-macosx-browser)
#+end_src


** OS X Don't open new frames from workspace requests

#+begin_src emacs-lisp
  (setq ns-pop-up-frames nil)
#+end_src

* Emacs server

  #+begin_src emacs-lisp
    (server-start)
  #+end_src

 Add the edit-server for Chrome

#+begin_src emacs-lisp
 (require 'edit-server)
 (setq edit-server-new-frame nil)
 (edit-server-start)
#+end_src

* Bindings
  
** Misc bindings

*** Clipboard management

#+begin_src emacs-lisp
  (global-set-key (kbd "C-c v") 'clipboard-yank)
  (global-set-key (kbd "C-c c") 'clipboard-kill-ring-save)
 #+end_src

*** Go to a line
 #+begin_src emacs-lisp
      (global-set-key (kbd "M-g") 'goto-line)
 #+end_src

*** Steve Yegge's bindings for backward-kill-word and my replacement for kill-region

 #+begin_src emacs-lisp
   (global-set-key (kbd "C-w") 'backward-kill-word)
   (global-set-key (kbd "C-c w") 'kill-region)
 #+end_src

*** Printing

#+begin_src emacs-lisp 
  (global-set-key (kbd "M-p") 'print-to-pdf)
#+end_src emacs-lisp

*** Zone when idle

#+begin_src emacs-lisp
  (defun zone-on ()
    (interactive)
    (zone-when-idle 60))
    (global-set-key (kbd "C-x M-z") 'zone-on)
#+end_src

*** Window management

   Window shortcuts lifted from some guy's config... 

   #+begin_src emacs-lisp
     ;; Map the window manipulation keys to meta 0, 1, 2, o
     (global-set-key (kbd "M-3") 'split-window-horizontally) ; was digit-argument
     (global-set-key (kbd "M-2") 'split-window-vertically) ; was digit-argument
     (global-set-key (kbd "M-1") 'delete-other-windows) ; was digit-argument
     (global-set-key (kbd "M-0") 'delete-window) ; was digit-argument
     (global-set-key (kbd "M-o") 'other-window) ; was facemenu-keymap
     ;; Replace dired's M-o
     (add-hook 'dired-mode-hook (lambda () (define-key dired-mode-map (kbd "M-o") 'other-window))) ; was dired-omit-mode
     ;; Replace ibuffer's M-o
     (add-hook 'ibuffer-mode-hook (lambda () (define-key ibuffer-mode-map (kbd "M-o") 'other-window))) ; was ibuffer-visit-buffer-1-window
     (windmove-default-keybindings 'meta)
     
     (global-set-key (kbd "C-x t") 'toggle-transparency)
   #+end_src


*** Maximize frame
#+begin_src emacs-lisp
 (global-set-key (kbd "C-|") 'maximize-frame)
 (global-set-key (kbd "C->") 'halve-frame-h)
 (global-set-key (kbd "C-<") 'halve-frame-v)
#+end_src

*** LaTeX and orgtbl

#+begin_src emacs-lisp
(defun orgtbl-latex-keys ()
 (progn 
    (define-key LaTeX-mode-map (kbd "C-c C-t i") 'orgtbl-insert-radio-table)
    (define-key LaTeX-mode-map (kbd "C-c C-t s") 'orgtbl-send-table)))

(add-hook 'LaTeX-mode-hook 'orgtbl-latex-keys)
#+end_src

*** Smex

#+begin_src emacs-lisp
  (global-set-key (kbd "M-x") 'smex)
  (global-set-key (kbd "M-X") 'smex-major-mode-commands)
#+end_src

*** Comment region
#+begin_src emacs-lisp
  (global-set-key (kbd "C-M-'") 'comment-or-uncomment-region)
#+end_src

*** Breadcrumbs

#+begin_src emacs-lisp
;(global-set-key (kbd "M-]") 'bc-set)
;(global-set-key (kbd "M-[") 'bc-previous)
#+end_src

*** Expand Region
#+begin_src emacs-lisp
(global-set-key (kbd "C-{") 'er/expand-region)
#+end_src
