mvr.el

(set-default 'fill-column 80)

(setq truncate-lines t)
(setq truncate-partial-width-windows nil)

(setq column-number-mode t)

(setq savehist-file (concat mvr-elisp-root "/history"))

(when (fboundp 'toggle-scroll-bar)
  (toggle-scroll-bar -1))

(global-auto-revert-mode t)

(visual-line-mode t)
(add-hook 'text-mode-hook 'visual-line-mode)

(starter-kit-load "ruby")
;;(starter-kit-load "lisp")
;;(starter-kit-load "misc-recommended")
(starter-kit-load "org")

(when window-system
  (tooltip-mode -1)
  (tool-bar-mode -1))

(menu-bar-mode -1)

(add-hook 'after-save-hook
  'executable-make-buffer-file-executable-if-script-p)

(setq confirm-nonexistent-file-or-buffer nil)

(require 'growl)

;;(if (eq system-type 'darwin) (funcall (lambda ()(setenv "PATH" (concat "/opt/local/bin:/usr/local/bin:" (getenv "PATH"))) (push "/opt/local/bin" exec-path))))
(if (eq system-type 'darwin) (progn (setenv "PATH" (concat
"/opt/local/bin:/usr/local/bin:/usr/texbin/:" (getenv "PATH"))) (append
(list "/opt/local/bin" "/usr/local/bin" "/usr/texbin/" "/Users/mvr/bin")
exec-path)
(setq exec-path (append
(list "/opt/local/bin" "/usr/local/bin" "/usr/texbin/" "/Users/mvr/bin")
exec-path))))

(defun ns-raise-emacs ()
  (ns-do-applescript "tell application \"Emacs\" to activate"))

(setq ns-command-modifier (quote meta))

(setq browse-url-browser-function 'browse-default-macosx-browser)

(setq ns-pop-up-frames nil)

(server-start)

(global-set-key (kbd "C-c v") 'clipboard-yank)
(global-set-key (kbd "C-c c") 'clipboard-kill-ring-save)

(global-set-key (kbd "M-g") 'goto-line)

(global-set-key (kbd "C-w") 'backward-kill-word)
(global-set-key (kbd "C-c w") 'kill-region)

(global-set-key (kbd "M-p") 'print-to-pdf)

(defun zone-on ()
  (interactive)
  (zone-when-idle 60))
  (global-set-key (kbd "C-x M-z") 'zone-on)

;; Map the window manipulation keys to meta 0, 1, 2, o
(global-set-key (kbd "M-3") 'split-window-horizontally) ; was digit-argument
(global-set-key (kbd "M-2") 'split-window-vertically) ; was digit-argument
(global-set-key (kbd "M-1") 'delete-other-windows) ; was digit-argument
(global-set-key (kbd "M-0") 'delete-window) ; was digit-argument
(global-set-key (kbd "M-o") 'other-window) ; was facemenu-keymap
;; Replace dired's M-o
(add-hook 'dired-mode-hook (lambda () (define-key dired-mode-map (kbd "M-o") 'other-window))) ; was dired-omit-mode
;; Replace ibuffer's M-o
(add-hook 'ibuffer-mode-hook (lambda () (define-key ibuffer-mode-map (kbd "M-o") 'other-window))) ; was ibuffer-visit-buffer-1-window
(windmove-default-keybindings 'meta)

(global-set-key (kbd "C-x t") 'toggle-transparency)

(global-set-key (kbd "C-|") 'maximize-frame)
(global-set-key (kbd "C->") 'halve-frame-h)
(global-set-key (kbd "C-<") 'halve-frame-v)

(defun orgtbl-latex-keys ()
 (progn 
    (define-key LaTeX-mode-map (kbd "C-c C-t i") 'orgtbl-insert-radio-table)
    (define-key LaTeX-mode-map (kbd "C-c C-t s") 'orgtbl-send-table)))

(add-hook 'LaTeX-mode-hook 'orgtbl-latex-keys)

(global-set-key (kbd "M-x") 'smex)
(global-set-key (kbd "M-X") 'smex-major-mode-commands)

(global-set-key (kbd "C-M-'") 'comment-or-uncomment-region)
